{
  "backend/main.mo": "Main Motoko actor defining all types (TradeEntry, UserProfile, PerformanceGoals, CalendarDayPerformance, FTMOAnalytics, etc.) and integrating Storage, AccessControl, and Authorization mixins for the trading journal backend.",
  "feature_evidence.json": "Feature evidence report documenting three completed features updating the pre-trade checklist to four items (Bias, OBS, LQS, FVG) in AddTradeDialog, EditTradeDialog, and TradesList components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App.tsx, hooks, pages, and components with details about authentication, trade management, performance analytics, and the updated four-item checklist.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS variables for light and dark themes including primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Private Trading Journal Web App.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup, Internet Identity authentication flow, profile setup modal, theme provider, toast notifications, and loading states with Header/Footer layout wrapper.",
  "frontend/src/components/AchievementBadge.tsx": "Component displaying achievement badges with icons (Trophy, Target, Star) based on status (targetReached, goalAchieved, milestone) with configurable sizes and themed styling.",
  "frontend/src/components/AddTradeDialog.tsx": "Dialog component for adding new trade entries with form inputs for trade details (asset, direction, prices, position size), image uploads (before/after), tag management, and a pre-trade checklist with risk metrics calculations.",
  "frontend/src/components/CalendarView.tsx": "Calendar component displaying monthly trade performance with color-coded days (profit/loss/neutral), clickable day details showing trades and metrics, and navigation controls with refresh functionality.",
  "frontend/src/components/EditTradeDialog.tsx": "Dialog component for editing existing trade entries, pre-populating form fields with trade data and supporting updates to all trade properties including images, tags, and checklist items.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/FTMOAnalytics.tsx": "Analytics dashboard component displaying FTMO challenge compliance metrics including max daily loss/profit, profit target progress, consistency rate, average risk percentage, and risk/reward ratios with color-coded compliance indicators.",
  "frontend/src/components/Header.tsx": "Application header with branding, authentication controls (login/logout via Internet Identity), user profile dropdown showing account balance, theme toggle (light/dark mode), and navigation functionality.",
  "frontend/src/components/MetricsOverview.tsx": "Displays key trading metrics in a card grid including total P&L, win rate, average risk percentage, risk-reward ratio, and best/worst trades with color-coded indicators.",
  "frontend/src/components/PerformanceCharts.tsx": "Renders interactive charts using Recharts to visualize cumulative P&L, equity curve, monthly profit/loss breakdown, and win/loss distribution across trades.",
  "frontend/src/components/PerformanceGoals.tsx": "Displays progress toward weekly and monthly profit targets and drawdown limits with progress bars, status indicators, and achievement badges.",
  "frontend/src/components/PerformanceSummary.tsx": "Shows aggregate performance statistics including total P&L, cumulative return, win rate, and weekly/monthly performance charts with FTMO analytics integration.",
  "frontend/src/components/ProfileEditDialog.tsx": "Modal dialog for editing user profile settings including name, account balance, currency selection, and performance goals (monthly/weekly targets and drawdown limits).",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup, collecting name, account balance, currency selection, and optional performance goals (monthly profit, weekly target, max drawdown). Prevents dismissal until profile is saved.",
  "frontend/src/components/TradesList.tsx": "Displays a filterable table of trade entries with edit/delete actions, detailed trade view dialog, and CSV export functionality. Includes tag filtering, profit/loss color coding, and image viewing capabilities.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider, managing login state, identity persistence, and AuthClient lifecycle with configurable options for delegation and idle behavior.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend operations including user profile management, trade CRUD operations, performance metrics, tags, and calendar data with optimistic updates and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, sidebar, and applying base styles with font features.",
  "frontend/src/lib/utils.ts": "Utility functions including className merging (cn), currency formatting with symbol lookup for 34+ currencies, and compact number formatting for calendar displays.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component that displays trading metrics, performance charts, trades list, calendar view, and FTMO analytics using tabs; includes logic to calculate FTMO compliance metrics from trade data.",
  "frontend/src/pages/Homepage.tsx": "Homepage component that shows a landing page for unauthenticated users and a summary dashboard for authenticated users, displaying recent trades, performance metrics, goals progress, and achievement badges.",
  "frontend/src/types/index.ts": "TypeScript type definitions mirroring backend structures for trade entries, user profiles, performance goals, calendar data, FTMO analytics, and achievement badges.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, container settings, border radius variables, shadows, animations, and font families for the application's design system.",
  "project_state.json": "Project state tracking file documenting completed features for updating pre-trade checklist to four items (Bias, OBS, LQS, FVG) across AddTradeDialog, EditTradeDialog, and TradesList components."
}